# Agenda

1. Data frames (2D data)
2. Reading (and writing) files -- real-world data!

To download: https://files.lerner.co.il/data-science-exercise-files.zip

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

When we import a module, we're basically asking Python to do the following:

1. Find the module (ending with "py") on disk
2. Load it into memory
3. Cache it, so that we don't need to load it a second time
4. Define the module as a variable in our global namespace

The second time we use import, we just jump directly to step 4.

In [4]:
import sys
sys.modules['pandas']  # sys.modules is the cache that Python uses for modules

What about "from import"?

In that case, it takes a slightly different route:

1. Find the module (ending with "py") on disk
2. Load it into memory
3. Cache it, so that we don't need to load it a second time
4. Defines only the names we've specified in our global namespace

In [5]:
from random import randint

In [6]:
sys.modules['random']

In [7]:
# If I want to create a data frame...

# list of lists
df = DataFrame([[10, 20, 30, 40],
               [50, 60, 70, 80],
               [90, 100, 110, 120]])
df

    0    1    2    3
0  10   20   30   40
1  50   60   70   80
2  90  100  110  120

As with a series, we have an index -- along the left column, describing our rows

We also have columns, which are along the top row, describing the columns.

By default, both are numbered starting at 0.

We can set one or both by passing "index=" or "columns=" when we create teh data frame. And yes, we can modify those down the road.

In [8]:
df = DataFrame([[10, 20, 30, 40],
               [50, 60, 70, 80],
               [90, 100, 110, 120]],
              index=list('abc'),
              columns=list('wxyz'))
df

    w    x    y    z
a  10   20   30   40
b  50   60   70   80
c  90  100  110  120

In [9]:
# retrieving a row -- we use .loc and .iloc

df.loc['a']

w    10
x    20
y    30
z    40
Name: a, dtype: int64

In [10]:
df.loc[['a', 'c']]   # fancy indexing -- request more than one row

    w    x    y    z
a  10   20   30   40
c  90  100  110  120

In [11]:
# I can also use .iloc

df.iloc[1]

w    50
x    60
y    70
z    80
Name: b, dtype: int64

In [12]:
# how can I retrieve one or more columns? Use []
df['w']

a    10
b    50
c    90
Name: w, dtype: int64

In [13]:
# can I get more than one columns? Yes!
df[['w', 'y']]

    w    y
a  10   30
b  50   70
c  90  110

In [14]:
# what about numbering our columns?  that doesn't really happen.

# what about slices of rows?
df.loc['a':'c']

    w    x    y    z
a  10   20   30   40
b  50   60   70   80
c  90  100  110  120

In [15]:
df.loc['a':'c':2]

    w    x    y    z
a  10   20   30   40
c  90  100  110  120

In [17]:
# you don't need .loc when asking for a slice!
# yes, this is hugely inconsistent

df['a':'c':2]

    w    x    y    z
a  10   20   30   40
c  90  100  110  120

In [18]:
df

    w    x    y    z
a  10   20   30   40
b  50   60   70   80
c  90  100  110  120

Let's say that I want a particular row and a particular column. I'll use .loc for this, as well -- I'll just use its two-argument version:

    df.loc[ROW_SELECTOR, COLUMN_SELECTOR]
    
The row selector (and column selector, for that matter), can be:

1. An individual row name
2. A list of row names (indexes)
3. A boolean series/list

This is the standard way to work with data frames.

In [19]:
# if I want row b, column y

df.loc['b', 'y']

70

In [20]:
# if I want row b, columns y and z

df.loc['b', ['y', 'z']]

y    70
z    80
Name: b, dtype: int64

In [21]:
# if I want rows a and c, columns y and z

df.loc[['a', 'c'], ['y', 'z']]

     y    z
a   30   40
c  110  120

In [22]:
# you can write it on two lines

df.loc[
    ['a', 'c'],   # row selector
    ['y', 'z']    # column selector
]

     y    z
a   30   40
c  110  120

In [26]:
# I can use a boolean index here

df.loc[
    df['x'] > df['x'].mean(),   # row selector
    ['y', 'z']                  # column selector
]

     y    z
c  110  120

# Exercises with data frames

1. Create a 5x5 data frame with rows abcde and columns vwxyz. The values should be random integers from 0-1,000. (You can use a 2D NumPy array for this, if you want.)

2. Retrieve row b
3. Retrieve rows b and d
4. Retrieve rows b, c, and d
5. Retrieve column w
6. Retrieve columns w and y
7. Retrieve columns w, x, and y
8. Retrieve the item at row e, column v

In [27]:
np.random.seed(0)  # this sets the random number generator

In [29]:
np.random.randint(0, 100, 25).reshape(5, 5)

array([[ 9, 20, 80, 69, 79],
       [47, 64, 82, 99, 88],
       [49, 29, 19, 19, 14],
       [39, 32, 65,  9, 57],
       [32, 31, 74, 23, 35]])

In [30]:
np.random.randint(0, 100, [5,5])

array([[75, 55, 28, 34,  0],
       [ 0, 36, 53,  5, 38],
       [17, 79,  4, 42, 58],
       [31,  1, 65, 41, 57],
       [35, 11, 46, 82, 91]])

In [34]:
# 1. Create a 5x5 data frame with rows abcde and columns vwxyz. The values should be random integers from 0-1,000. (You can use a 2D NumPy array for this, if you want.)

np.random.seed(0)
df = DataFrame(np.random.randint(0, 1000, [5,5]),
         index=list('abcde'),
         columns=list('vwxyz'))
df

     v    w    x    y    z
a  684  559  629  192  835
b  763  707  359    9  723
c  277  754  804  599   70
d  472  600  396  314  705
e  486  551   87  174  600

In [35]:
# 2. Retrieve row b

df.loc['b']

v    763
w    707
x    359
y      9
z    723
Name: b, dtype: int64

In [36]:
# 3. Retrieve rows b and d

df.loc[['b', 'd']]

     v    w    x    y    z
b  763  707  359    9  723
d  472  600  396  314  705

In [37]:
df.loc['b':'d':2]

     v    w    x    y    z
b  763  707  359    9  723
d  472  600  396  314  705

In [38]:
# 4. Retrieve rows b, c, and d

df.loc['b':'d']

     v    w    x    y    z
b  763  707  359    9  723
c  277  754  804  599   70
d  472  600  396  314  705

In [39]:
df['b':'d']  # slice on a data frame gives us the rows

     v    w    x    y    z
b  763  707  359    9  723
c  277  754  804  599   70
d  472  600  396  314  705

In [40]:
%timeit df.loc['b':'d']

625 µs ± 66.2 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [41]:
%timeit df['b':'d']

545 µs ± 78.6 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [42]:
# 5. Retrieve column w

df['w']

a    559
b    707
c    754
d    600
e    551
Name: w, dtype: int64

In [43]:
# 6. Retrieve columns w and y

df[['w', 'y']]

     w    y
a  559  192
b  707    9
c  754  599
d  600  314
e  551  174

In [44]:
# 7. Retrieve columns w, x, and y

df[['w', 'x', 'y']]

     w    x    y
a  559  629  192
b  707  359    9
c  754  804  599
d  600  396  314
e  551   87  174

In [45]:
# 8. Retrieve the item at row e, column v

df.loc[
      'e', # row selector
       'v' # column selector
]

486

In [48]:
df.loc[:, 'w':'y']

     w    x    y
a  559  629  192
b  707  359    9
c  754  804  599
d  600  396  314
e  551   87  174

In [49]:
# dtypes -- columns are series

# every column in a data frame is actually a series behind the scenes

df['v'].dtype

dtype('int64')

In [50]:
df.loc['a'].dtype

dtype('int64')

In [51]:
# I can get the dtypes of all columns with the "dtypes" attribute

df.dtypes

v    int64
w    int64
x    int64
y    int64
z    int64
dtype: object

In [52]:
# we can assign to values in a data frame via .loc!

df

     v    w    x    y    z
a  684  559  629  192  835
b  763  707  359    9  723
c  277  754  804  599   70
d  472  600  396  314  705
e  486  551   87  174  600

In [53]:
df.loc['c', 'y']

599

In [54]:
df.loc['c', 'y'] = 222

df

     v    w    x    y    z
a  684  559  629  192  835
b  763  707  359    9  723
c  277  754  804  222   70
d  472  600  396  314  705
e  486  551   87  174  600

In [55]:
df.loc[['a', 'c'], ['x', 'y']]

     x    y
a  629  192
c  804  222

In [56]:
df.loc[['a', 'c'], ['x', 'y']] = 333
df

     v    w    x    y    z
a  684  559  333  333  835
b  763  707  359    9  723
c  277  754  333  333   70
d  472  600  396  314  705
e  486  551   87  174  600

In [60]:
# change the order of columns, if you want
df = df[['y', 'z', 'v', 'x', 'w']]

In [61]:
df

     y    z    v    x    w
a  333  835  684  333  559
b    9  723  763  359  707
c  333   70  277  333  754
d  314  705  472  396  600
e  174  600  486   87  551

# Some other ways to create data frames

1. List of lists
2. 2D NumPy array
3. List of dicts -- the dict keys specify the column names, and each list is a row
4. Dict of lists -- the dict keys specify the column names, and each list is a column. Each list must be of the same length.

In [62]:
df = DataFrame([{'a':10, 'b':20, 'c':30},
                {'a':100, 'b':200, 'd':400},
               {'a':1000, 'c':3000, 'd':4000}])
df

      a      b       c       d
0    10   20.0    30.0     NaN
1   100  200.0     NaN   400.0
2  1000    NaN  3000.0  4000.0

In [63]:
df.dtypes

a      int64
b    float64
c    float64
d    float64
dtype: object

In [67]:
# create a data frame with a list of dicts
df = DataFrame([{'a':10, 'b':20, 'c':30},
                {'a':100, 'b':200, 'd':400},
               {'a':1000, 'c':3000, 'd':4000}])
df

      a      b       c       d
0    10   20.0    30.0     NaN
1   100  200.0     NaN   400.0
2  1000    NaN  3000.0  4000.0

In [69]:
# what if I retrieve row 0 from df?

df.loc[0]

a    10.0
b    20.0
c    30.0
d     NaN
Name: 0, dtype: float64

In [70]:
# create a data frame with a dict of lists

df = DataFrame({'a':[10, 20, 30], 
               'b':[100, 200, 300],
               'c':[1000, 2000, 3000]})

df

    a    b     c
0  10  100  1000
1  20  200  2000
2  30  300  3000

In [72]:
# basic methods

# the general rule: Any method that you can run on a series, you can also run
# on a data frame. You'll get a series back, whose index is the data frame's columns,
# and the values represent running the method on each of those columns


np.random.seed(0)
df = DataFrame(np.random.randint(0, 1000, [5,5]),
         index=list('abcde'),
         columns=list('vwxyz'))
df

     v    w    x    y    z
a  684  559  629  192  835
b  763  707  359    9  723
c  277  754  804  599   70
d  472  600  396  314  705
e  486  551   87  174  600

In [73]:
df['v'].mean()

536.4

In [74]:
df.mean()  # calculate the mean for each column

v    536.4
w    634.2
x    455.0
y    257.6
z    586.6
dtype: float64

In [75]:
df.sum()

v    2682
w    3171
x    2275
y    1288
z    2933
dtype: int64

In [76]:
df.describe()  # descriptive statistics

                v           w           x           y           z
count    5.000000    5.000000    5.000000    5.000000    5.000000
mean   536.400000  634.200000  455.000000  257.600000  586.600000
std    191.774086   91.376693  273.951638  219.561609  300.574949
min    277.000000  551.000000   87.000000    9.000000   70.000000
25%    472.000000  559.000000  359.000000  174.000000  600.000000
50%    486.000000  600.000000  396.000000  192.000000  705.000000
75%    684.000000  707.000000  629.000000  314.000000  723.000000
max    763.000000  754.000000  804.000000  599.000000  835.000000

In [57]:
# adding rows/columns (including columns of arrays)
# fillna / dropna
# removing rows and columns
# setting/unsetting the index
# queries based on rows/columns